//
//  PersonViewController.swift
//  Alash
//
//  Created by Admin on 9/19/16.
//  Copyright © 2016 AAkash. All rights reserved.
//

import UIKit
import KMPlaceholderTextView

class PersonViewController: UIViewController {
    
    let screenBounds = UIScreen.mainScreen().bounds
    
    var scrollView = UIScrollView()
    
    var persons = ["Алпысбай Қалменов", "Аспандияр Кенжин", "Ахмет Байтұрсынұлы", "Әбубәкір Алдияров", "Әлихан Бөкейхан", "Елдес Омаров", "Ережеп Итбаев", "Жанша Досмұхамедов", "Ілияс Жансүгіров", "Мағжан Жұмабай", "Міржақып Дулатұлы", "Мұстафа Шоқай", "Мұхаметжан Тынышбайұлы", "Мырзағазы Есполов", "Мұқыш Боштаев", "Садық Аманжолов", "Сейілбек Жанайдаров", "Халел Ғаббасов",  "Халел Досмұхамедов", "Тел Жаманмұрынов",  "Уәлитхан Танашев", "Хамит Тоқтамышев", "Шонанов Телжан"]
    
    var infos = ["Алпысбай Қалменов - Алаштың белгілі азаматы Қалменов Алпысбай 1869 жылы Орал облысы, Темір уезінде туған. Бала кезінде ауыл молдасынан сауатын ашқан. Кейін Орынбор гимназиясында оқып, орыс тілін жетік меңгереді. XIX ғасырдың соңы мен XX ғасырдың басында қазақ қоғамында оқу білімнің қадірі күшті болады. Сондықтан қолы жеткен ата-ана баласының білім жолына түсуіне ықпал етеді. Соның арқасында қазақ арасынан оқымыстылар көп шыққан. Олар қазақ зиялылары дуге лайық қауым болып, өздерінің ел алдындағы міндеттерін адал атқарды. А.Қалменов та білім жолына түсіп, кейін университет бітірген. Алайда оның қандай университетте қандай мамандық бойынша білім алғаны туралы нақты дерек жоқ. Жастық, жігіттік шағын XIX ғасырда өткізген Алпысбай XX ғасырға жігіт ағасы болып толысқан шағында жетті. Соған орай, XX ғасыр басындағы әлеуметтік-қоғамдық жұмыстарға көбірек араласады.", "Аспандияр Кенжин 1887 жылы Гурьев уезінің Рәкөш ауылында туған. Алаш партиясының Батыс Қазақстандағы белсенді мүшелерінің бірі. 1897- 1902 жылдары Есбол ауылында мектепте, Гурьев қаласындағы екі сыныптық орыс-қазақ мектебінде оқыған, 1902-1906 жылдары Орынбордағы орыс-қазақ мұғалімдер мектебін бітірген. Оқып жүрген кезінен бастап жаңашыл, халықшылдық бағыт ұстанады. 1907-1917 жылдары Орал губерниясында оқытушы болып жұмыс істейді.", "Ахмет Байтұрсынұлы (5 қыркүйек 1872 жыл, қазіргі Қостанай облысы, Жангелді ауданы Сарытүбек ауылы – 8 желтоқсан 1937, Алматы қаласы) — қазақтың ақыны, әдебиет зерттеуші ғалым, түркітанушы, публицист, педагог, аудармашы, қоғам қайраткері. Қазақ халқының 20 ғасырдың басындағы ұлт-азаттық қозғалысы жетекшілерінің бірі, мемлекет қайраткері, қазақ тіл білімі мен әдебиеттану ғылымдарының негізін салушы ғалым, ұлттық жазудың реформаторы, ағартушы, Алаш-Орда өкіметінің мүшесі.", "Әбубәкір Бермұхамедұлы Алдияров (1878 жыл, Торғай облысы Қостанай уезі Сарыой болысы — 27.09.1938 жыл, Тараз ) — қоғам қайраткері.", "Әлихан Нұрмұхамедұлы Бөкейхан (05 наурыз 1866, Қарқаралы уезі, Семей облысы, Дала Өлкесі - 27 қыркүйек 1937, Мәскеу) — XIX ғ. соңы мен XX ғ. басындағы қазақ зиялыларының, қоғам және мемлекет қайраткерлері қатарындағы аса ерекше тұлға. Көрнекті қоғам және мемлекет қайраткері, ұлт-азаттық және Алаш қозғалысының жетекшісі, Алашорда автономиялы үкіметінің төрағасы, публицист, ғалым, аудармашы.", "Елдес Омаров (1 наурыз 1892, бұрынғы Торғай облысы Қостанай уезі, Дамбар болысы, №2 ауылы – 2 желтоқсан 1937) – қоғам қайраткері, педагог, публицист. Қостанай қаласындағы 2 сыныптық орыс-қазақ училищесін (1907), Орынбордағы орыс-қазақ мұғалімдер мектебін (1911) бітірген. Алашорда үкіметін құруға белсене араласты. Уақытша үкіметтің Торғай уездік комиссарының көмекшісі, Торғай облысы азаматтық комитетінің төрағасы қызметтерін атқарды. Бірінші және екінші жалпықазақ съездеріне қатысты. Қостанайда өткен Қостанай уезі қазақтарының төтенше съезінде “Жер мәселесі” туралы баяндама жасады. Қостанай уездік Алашорда комитетінің төрағасы ретінде жергілікті халықты Алаш автономиясын қолдауға шақырды. Торғай облысы земствосы төрағасының орынбасары, төрағасы болды.", "Итбаев Ережеп(1885-1936) - Алаш қозғалысының қайраткері, өз заманының көзі ашық азаматы, қазақ халқының күрескер, талантты ұлдарының бірі. Жасында Омбыда гимназияда оқыған. Зерттеушілердің деректеріне қарағанда, кейін Томскі университетіне оқуға түседі. Онда қандай мамандықта оқығаны белгісіз. Оның үстіне, оқуын аяқтамай университеттен шығып кеткен. Итбаев Ережеп университеттен шыққанмен, білімге деген ынтасын жоғалтпай ізденеді. Оқығанын көкірегіне тоқи білетін азамат өзі ізденіп, өмірден мол білім жинайды. Орыс тілін жақсы меңгереді. Соның арқасында әлеуметтік жұмыстарға араласады. 1897-1898 жылдары Қарқаралы, Кереку уездерінің жер мәселесін зерттеуге шыққан экспедицияның құрамында болады.", "Жанша Досмұхамедов (Жаһанша) (1886 Орал облысы, Орал уезі, Жымпиты болысы № 1 ауылы - 1937), Алаш қозғалысының аса көрнекті қайраткері, Алашорда үкіметінің мүшесі, Алашорданың Батыс бөлімшесінің төрағасы, заңгер.", "Ілияс Жансүгіров – ақын, драмашы, прозашы, оның поэзиясы ұлттық әдебиеттің классикалық байлығының қатарына жатады. Ақынның терең идеялы, көркем мүсінді, эпикалық кең тынысты шығармаларының танымдық, тәрбиелік мәні зор.Олар қалың оқырманның ойына ой, сезіміне сезім қосады, қиялына қанат бітіреді, эстетикалық ләззат беріп, гуманистік адамгершілік идеяларды толғайды.", "Мағжан Жұмабай (Әбілмағжан) Бекенұлы (25 маусым 1893, Солтүстік Қазақстан облысы, қазіргі Мағжан Жұмабаев ауданы, Сасықкөл жағасы – 19 наурыз 1938, Алматы) – Алаш қозғалысының қайраткері, ақын, қазақ әдебиетінің жарқын жұлдызы өкілі.", "Міржақып Дұлатұлы (1885—1935) — қазақтың аса көрнекті ағартушысы, қоғам қайраткері, ақын, жазушы, жалынды көсемсөз шебері. Міржақып Дулатұлы — әдебиеттің әр түрлі жанрына қалам тартқан қаламгер. Алғашқы кітабы — Оян, қазақ! деген атпен Петербург қаласындағы жарық көрген өлең жинағы. Одан кейін 1913 жылы Орьнборда Азамат, ал 1915 жылы Терме атты өлеңдер кітаптары басылып шығады. Ақын өлеңдерінің басты такырыбы—ел тағдыры болды. Алғашқы кітабы Оян, қазақ! жұртшылық арасында ауыздан-ауызға, қолдан-қолға тез тарап кетеді. Қайта басылады. Кітаптың нeriзгi мазмұны халықты оятуға, әділетсіздікпен күресуге шақырған өлеңдер құрады. Сол себепті де кітап тұтқындалып, авторы қуғынға ұшырайды.", "Мұстафа Шоқай", "Мұхаметжан Тынышбайұлы", "Мырзағазы Есполов", "Мұқыш Боштаев", "Садық Аманжолов", "Сейілбек Жанайдаров", "Халел Ғаббасов",  "Халел Досмұхамедов", "Тел Жаманмұрынов",  "Уәлитхан Танашев", "Хамит Тоқтамышев", "Шонанов Телжан"]
    
     var images = ["alpysbai.kalmenov", "alash", "akhmet.baitursynuly", "alash", "alikhan.bokeikhan", "eldes.omarov", "alash", "janwa.dosmukhamedov", "ilyas.jansugirov", "magjan.jumabayev", "mirjakyp.dulatov", "Мұстафа Шоқай", "Мұхаметжан Тынышбайұлы", "Мырзағазы Есполов", "Мұқыш Боштаев", "Садық Аманжолов", "Сейілбек Жанайдаров", "Халел Ғаббасов",  "Халел Досмұхамедов", "Тел Жаманмұрынов",  "Уәлитхан Танашев", "Хамит Тоқтамышев", "Шонанов Телжан"]
    
    var index = 0
    
    var imageView = UIImageView()
    var personLabel = UILabel()
    var textView = UITextView()

    override func viewDidLoad() {
        super.viewDidLoad()

        self.edgesForExtendedLayout = .None
        
        self.navigationController?.navigationBar.barTintColor = UIColor.blackColor()
        let attributes = [
            NSForegroundColorAttributeName: UIColor.whiteColor(),
            NSFontAttributeName: UIFont(name: "Helvetica", size: screenBounds.width*0.05)!
        ]
        self.navigationController?.navigationBar.titleTextAttributes = attributes
        
        self.automaticallyAdjustsScrollViewInsets = true
        
        title = "Қайраткер"

        setup()
    }

    func setup() {
        
        scrollView = UIScrollView(frame: CGRect(x: 0, y: 0, width: screenBounds.width, height: screenBounds.height))
        scrollView.scrollEnabled = true
        scrollView.contentSize = CGSizeMake(screenBounds.width, 1.3*screenBounds.height)
        self.view.addSubview(scrollView)
    
        imageView = UIImageView(frame: CGRect(x: 0, y: 0, width: screenBounds.width, height: screenBounds.height*0.5))
        imageView.image = UIImage(named: images[index])
        let gradient: CAGradientLayer = CAGradientLayer()
        gradient.frame = imageView.frame
        gradient.colors = [UIColor.clearColor().CGColor, UIColor.blackColor().CGColor]
        gradient.locations = [0.0, 1]
        imageView.layer.insertSublayer(gradient, atIndex: 0)
        self.scrollView.addSubview(imageView)
        
        personLabel = UILabel(frame: CGRect(x: screenBounds.width*0.04, y: screenBounds.height*0.4, width: screenBounds.width*0.92, height: screenBounds.height*0.1))
        personLabel.font = UIFont(name: "Helvetica", size: screenBounds.width*0.06)
        personLabel.text = persons[index]
        personLabel.textColor = UIColor.whiteColor()
        self.scrollView.addSubview(personLabel)
        
        textView = UITextView(frame: CGRect(x: screenBounds.width*0.03, y: screenBounds.height*0.5, width: screenBounds.width*0.94, height: screenBounds.height*0.5))
        textView.font = UIFont(name: "Helvetica", size: screenBounds.width*0.05)
        textView.layer.backgroundColor = UIColor.clearColor().CGColor
        textView.text = infos[index]
        textView.sizeToFit()
        textView.scrollEnabled = false
        self.scrollView.addSubview(textView)
    }
}
